#include <iostream>
#include <string>
#include <vector>
using namespace std;

int main()
{
    int mt= 0;
    string answer=" ";
    std::vector <std::string> a = {
        "70590","999","6:50","Садик","11","2010","4300",
        "Усатый-полосатый","3","11015","Учительница","150880","10055","7","10","2018"
    };

    std::vector <std::string> q = {
        "Ведите пароль...",
        "Номер предмета который тебя всегда спасает",
        "Время твоего рождения(Часы и минуты через :)",
        "Что для тебя Солнышко в твой жизни",
        "Сколько тебе было месяцев когда ты первый раз попал в Кушву",
        "Найди Настю и узнай вопрос",
        "Твой вес при рождении,гр",
        "Любимая книжка в детстве",
        "Сколько лет ты ходил в мызыкальную школу?",
        "Ищи на первом этаже дома",
        "У кого в твоей жизни были инициалы М.В.И.",
        "Иди ты в баню",
        "Количество твоих машин умножить на год в который ты выложил аватарку в ВКонтакте",
        "Сколько было дверей в квартире на Народной",
        "Сколько фотографий висит над вашей кроватью в спальне",
        "В каком году снесли телебашню  в Екатеринбурге"
    };
    cout<<"Если понадобиться подсказка ищи нас\n";
    for(int i = 0; i<a.size();i++){
        cout<<"Задание №"<<i+1<<endl;
        cout<<q[i]<<"\nОтвет: ";
        cin>>answer;
       
        while(answer!=a[i]){
            mt++;
            cout<<"Неверно :(\n";
            cout<<q[i]<<"\nОтвет: ";
            cin>>answer;  
        }
        cout<<"Правильно!!! :)(:\n";
    }  
    cout<<"Поздравляем!!! "<<mt<<" ошибок\n";    
}